vmux0.0.10-pre/ycsbVMs_ycsb_64vms_bridge-vhost_-1rps_rep1/vm6.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-10-03 03:36:13:492 0 sec: 0 operations; est completion in 0 second [UPDATE: Count=1, Max=26639, Min=26624, Avg=26632, 90=26639, 99=26639, 99.9=26639, 99.99=26639] 
2024-10-03 03:36:23:321 10 sec: 40012 operations; 4000.8 current ops/sec; est completion in 1 day 5 hours [READ: Count=20022, Max=32223, Min=97, Avg=237.63, 90=366, 99=508, 99.9=1470, 99.99=6371] [UPDATE: Count=19991, Max=8155, Min=96, Avg=235.32, 90=364, 99=514, 99.9=1681, 99.99=4587] 
2024-10-03 03:36:33:321 20 sec: 68050 operations; 2803.8 current ops/sec; est completion in 1 day 11 hours [READ: Count=13955, Max=4191, Min=166, Avg=354.74, 90=439, 99=548, 99.9=702, 99.99=2477] [UPDATE: Count=14081, Max=4223, Min=191, Avg=349.54, 90=434, 99=545, 99.9=665, 99.99=1850] 
2024-10-03 03:36:43:321 30 sec: 95971 operations; 2792.1 current ops/sec; est completion in 1 day 13 hours [READ: Count=13883, Max=4471, Min=150, Avg=358.81, 90=441, 99=545, 99.9=698, 99.99=3701] [UPDATE: Count=14038, Max=3793, Min=162, Avg=352.13, 90=437, 99=547, 99.9=643, 99.99=1960] 
2024-10-03 03:36:53:321 40 sec: 123863 operations; 2789.2 current ops/sec; est completion in 1 day 14 hours [READ: Count=13801, Max=8727, Min=157, Avg=359.24, 90=442, 99=537, 99.9=686, 99.99=3851] [UPDATE: Count=14091, Max=3511, Min=171, Avg=352.39, 90=437, 99=536, 99.9=602, 99.99=1326] 
2024-10-03 03:37:03:321 50 sec: 151856 operations; 2799.3 current ops/sec; est completion in 1 day 15 hours [READ: Count=13920, Max=2123, Min=193, Avg=358.35, 90=441, 99=543, 99.9=632, 99.99=1164] [UPDATE: Count=14073, Max=6051, Min=187, Avg=351.15, 90=435, 99=539, 99.9=652, 99.99=859] 
2024-10-03 03:37:13:321 60 sec: 179720 operations; 2786.4 current ops/sec; est completion in 1 day 15 hours [READ: Count=13814, Max=5231, Min=189, Avg=359.12, 90=445, 99=552, 99.9=708, 99.99=1362] [UPDATE: Count=14050, Max=2703, Min=193, Avg=353.39, 90=440, 99=545, 99.9=627, 99.99=735] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-10-03 03:37:14:335 61 sec: 182547 operations; 2790.72 current ops/sec; est completion in 1 day 15 hours [READ: Count=1388, Max=946, Min=197, Avg=356.11, 90=441, 99=523, 99.9=570, 99.99=946] [CLEANUP: Count=1, Max=1295, Min=1295, Avg=1295, 90=1295, 99=1295, 99.9=1295, 99.99=1295] [UPDATE: Count=1439, Max=8127, Min=200, Avg=354.21, 90=433, 99=526, 99.9=975, 99.99=8127] 
[OVERALL], RunTime(ms), 61022
[OVERALL], Throughput(ops/sec), 2991.4948707023696
[TOTAL_GCS_Copy], Count, 17
[TOTAL_GC_TIME_Copy], Time(ms), 30
[TOTAL_GC_TIME_%_Copy], Time(%), 0.04916259709612927
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 17
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 0.04916259709612927
[READ], Operations, 90783
[READ], AverageLatency(us), 331.4589185199872
[READ], MinLatency(us), 97
[READ], MaxLatency(us), 32223
[READ], 95thPercentileLatency(us), 463
[READ], 99thPercentileLatency(us), 540
[READ], Return=OK, 90783
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1295.0
[CLEANUP], MinLatency(us), 1295
[CLEANUP], MaxLatency(us), 1295
[CLEANUP], 95thPercentileLatency(us), 1295
[CLEANUP], 99thPercentileLatency(us), 1295
[UPDATE], Operations, 91764
[UPDATE], AverageLatency(us), 326.68836362843814
[UPDATE], MinLatency(us), 96
[UPDATE], MaxLatency(us), 26639
[UPDATE], 95thPercentileLatency(us), 460
[UPDATE], 99thPercentileLatency(us), 539
[UPDATE], Return=OK, 91764
AUTOTEST_DONE